app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "start", "expectedDate", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "expectedDate" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["expectedDate", "2022-12-09"], ["updated_at", "2022-12-07 15:43:22.085329"], ["id", 1]]